# Introduction to Pandas

`pandas` is one of the most popular Python libraries used in data science. It makes data analysis fast and easy in Python. 

First, let's import `pandas` & `numpy`

In [1]:
import pandas as pd
import numpy as np

This is the standard way to import `pandas`. We don't want to have to write out 'pandas' everytime, but we do want to keep it clear so 'pd' is the common way to reference it. The same with 'numpy'.

The data being used for this tutorial is the *Auto MPG* data set available on the UCI Machine Learning Repository. For more information on the data set click [here](https://archive.ics.uci.edu/ml/datasets/Auto+MPG). I saved this data to a csv, but you can also read it in direcly from the website.

`Pandas` is a Python library that provides easy to use data structures. The primary data structure of `pandas` is the `DataFrame`. We can load a csv into pandas DataFrame by using the `read_csv`. Since there are no column names in the csv we can specify these while reading in the data. 

Be aware that missing data is often represented by a "?" in the UCI datasets. The `na_values` parameter in `read_csv` can be used to specify strings to be recognized as NaN.

In [2]:
colnames = ['mpg', 'cylinders', 'displacement', 'horsepower', 'weight', 'acceleration', 'model_year', 'origin', 'car_name']

df = pd.read_csv('/Users/abeasock/Documents/Data/auto_mpg.csv', names = colnames, na_values='?')

## Exploratory

You can verify the data was read in correctly by using the function `head`, which will return the first n rows. The default is 5 rows if n is not defined. 

**Note: I use `head()` in a lot of the examples below just to limit the size of the output printed**

In [3]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
0,18.0,8,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,1,ford torino

There is also the function `tail` to return the last n rows.

In [4]:
df.tail(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
395,32.0,4,135.0,84.0,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,1,chevy s-10

The DataFrame has an attribute `columns` for seeing a list of columns in the DataFrame.

In [5]:
df.columns

Index([u'mpg', u'cylinders', u'displacement', u'horsepower', u'weight',
       u'acceleration', u'model_year', u'origin', u'car_name'],
      dtype='object')

The `dtypes` function can be used to check the data types of the columns.

In [6]:
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin            int64
car_name         object
dtype: object

There is also the `info()` function that provides an overview of information.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
mpg             398 non-null float64
cylinders       398 non-null int64
displacement    398 non-null float64
horsepower      392 non-null float64
weight          398 non-null int64
acceleration    398 non-null float64
model_year      398 non-null int64
origin          398 non-null int64
car_name        398 non-null object
dtypes: float64(4), int64(4), object(1)
memory usage: 28.1+ KB

The `shape` function will return a tuple of the shape of the Dataframe. The below output shows that we have 398 rows and 9 columns.

In [8]:
df.shape

(398, 9)

You may just want to know how many records are in the dataframe and you can simply take the length by using the `len()` function.

In [9]:
len(df)

398

The `describe` method computes summary statistics for each column. By default it includes numeric columns, but the parameter `include='all'` can be added to include strings.

In [10]:
pd.options.display.float_format = '{:,.3f}'.format # Limit output to 3 decimal places.
df.describe()

C:\Anaconda2\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
count,398.000,398.000,398.000,392.000,398.000,398.000,398.000,398.000
mean,23.515,5.455,193.426,104.469,"2,970.425",15.568,76.010,1.573
std,7.816,1.701,104.270,38.491,846.842,2.758,3.698,0.802
min,9.000,3.000,68.000,46.000,"1,613.000",8.000,70.000,1.000
25%,17.500,4.000,104.250,nan,"2,223.750",13.825,73.000,1.000
50%,23.000,4.000,148.500,nan,"2,803.500",15.500,76.000,1.000
75%,29.000,8.000,262.000,nan,"3,608.000",17.175,79.000,2.000
max,46.600,8.000,455.000,230.000,"5,140.000",24.800,82.000,3.000

#### Other stats methods

    df.corr()   # Pairwise correlation columns
    df.cov()    # Pairwise covariance columns
    df.kurt()   # Kurtosis over columns
    df.mad()    # Mean absoluate deviation
    df.sem()    # Standard error of mean
    df.var()    # Variance over columns
    
Examples of a few:

In [11]:
df.corr()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
mpg,1.000,-0.775,-0.804,-0.778,-0.832,0.420,0.579,0.563
cylinders,-0.775,1.000,0.951,0.843,0.896,-0.505,-0.349,-0.563
displacement,-0.804,0.951,1.000,0.897,0.933,-0.544,-0.370,-0.609
horsepower,-0.778,0.843,0.897,1.000,0.865,-0.689,-0.416,-0.455
weight,-0.832,0.896,0.933,0.865,1.000,-0.417,-0.307,-0.581
acceleration,0.420,-0.505,-0.544,-0.689,-0.417,1.000,0.288,0.206
model_year,0.579,-0.349,-0.370,-0.416,-0.307,0.288,1.000,0.181
origin,0.563,-0.563,-0.609,-0.455,-0.581,0.206,0.181,1.000

In [12]:
df.kurt()

mpg            -0.511
cylinders      -1.377
displacement   -0.747
horsepower      0.697
weight         -0.786
acceleration    0.419
model_year     -1.181
origin         -0.818
dtype: float64

## Data Manipulation Techniques

### Convert Data Types of a Column

The columns mpg, displacement, and horsepower all seem like they can be integers. However, we can't convert horsepower from float to int until the missing values are handled, it currently contains NaN values and this would give us an error.

In [13]:
df[['mpg', 'displacement']] = df[['mpg', 'displacement']].astype(int)

df.dtypes

mpg               int32
cylinders         int64
displacement      int32
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin            int64
car_name         object
dtype: object

### Renaming a Column

In [14]:
df.rename(columns={'car_name':'make_model'}, inplace=True)  # Can also rename multiple columns, separate with comma

### Sorting

In [15]:
# The default is ascending order
df.sort_values(['make_model'], inplace=True) # inplace=True performs the operation in-place
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model
96,13,8,360,175.000,3821,11.000,73,1,amc ambassador brougham
9,15,8,390,190.000,3850,8.500,70,1,amc ambassador dpl
66,17,8,304,150.000,3672,11.500,72,1,amc ambassador sst
315,24,4,151,90.000,3003,20.100,80,1,amc concord
257,19,6,232,90.000,3210,17.200,78,1,amc concord

In [16]:
# Set parameter ascending=False to sort in descending order
df.sort_values(['make_model'], ascending=False).head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model
293,31,4,89,71.000,1925,14.000,79,2,vw rabbit custom
325,44,4,90,48.000,2085,21.700,80,2,vw rabbit c (diesel)
197,29,4,90,70.000,1937,14.200,76,2,vw rabbit
309,41,4,98,76.000,2144,14.700,80,2,vw rabbit
394,44,4,97,52.000,2130,24.600,82,2,vw pickup

### Selecting Columns

A DataFrame column is a pandas Series object.

Selecting a single column by label. This returns a series, not a dataframe. Let's add `head()` to keep it from printing out all the records.

In [17]:
df['make_model'].head()

96     amc ambassador brougham
9           amc ambassador dpl
66          amc ambassador sst
315                amc concord
257                amc concord
Name: make_model, dtype: object

Selecting multiple columns in the same manner as above.

In [18]:
df[['cylinders', 'make_model']].head()

     cylinders               make_model
96           8  amc ambassador brougham
9            8       amc ambassador dpl
66           8       amc ambassador sst
315          4              amc concord
257          6              amc concord

Maybe you're unsure of the columns full name or you want to select a group of columns that all partially contain the same name, you can use the 'like' to find column names containing the specified string.

In [19]:
df.filter(like='model').head()

     model_year               make_model
96           73  amc ambassador brougham
9            70       amc ambassador dpl
66           72       amc ambassador sst
315          80              amc concord
257          78              amc concord

### Add a New Column

For demonstration purposes, let's calculated the ratio of horsepower to weight

In [20]:
df['hp_wt_ratio'] = df['horsepower']/df['weight']

df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model,hp_wt_ratio
96,13,8,360,175.000,3821,11.000,73,1,amc ambassador brougham,0.046
9,15,8,390,190.000,3850,8.500,70,1,amc ambassador dpl,0.049
66,17,8,304,150.000,3672,11.500,72,1,amc ambassador sst,0.041
315,24,4,151,90.000,3003,20.100,80,1,amc concord,0.030
257,19,6,232,90.000,3210,17.200,78,1,amc concord,0.028

### Dropping

#### Drop a column
Note: axis=1 denotes that we are referring to a column and not a row

In [21]:
df.drop('hp_wt_ratio', axis=1, inplace=True)

#### Drop a row if it contains a certain value

In this example, let's drop all rows where cyclinders = 3. Remember this statement is written as to what you want to keep, so we need to write it as include all rows where the value of cylinders do not equal 3.

In [22]:
df2 = df[df['cylinders'] != 3]

print "Number of rows dropped: " + str(len(df)-len(df2))

Number of rows dropped: 4

### Filtering

Conditional expression can be used to filter a dataframe. Let's filter  the dataframe for cars with greater than 220 horsepower.

In [23]:
df[df.horsepower > 220]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model
95,12,8,455,225.000,4951,11.000,73,1,buick electra 225 custom
13,14,8,455,225.000,3086,10.000,70,1,buick estate wagon (sw)
8,14,8,455,225.000,4425,10.000,70,1,pontiac catalina
116,16,8,400,230.000,4278,9.500,73,1,pontiac grand prix

A series of booleans can be created based on a condition. If the horsepower is greater than 220 then "True" and "False" if not.

In [24]:
df.horsepower > 220

96     False
9      False
66     False
315    False
257    False
261    False
374    False
283    False
107    False
33     False
169    False
24     False
127    False
16     False
194    False
99     False
45     False
162    False
134    False
86     False
189    False
37     False
72     False
140    False
176    False
202    False
3      False
296    False
21     False
177    False
       ...
82     False
335    False
332    False
19     False
77     False
172    False
142    False
240    False
353    False
55     False
175    False
203    False
233    False
244    False
375    False
278    False
102    False
59     False
120    False
76     False
179    False
207    False
275    False
360    False
326    False
394    False
309    False
197    False
325    False
293    False
Name: horsepower, dtype: bool

You can also filter by multiple conditions. Note that each condition must be in parentheses and you cannot use 'and'/'or', use '&'/'|'

Let's find records where horsepower is greater than 220 and mpg is greater than 15.

In [25]:
df[(df.horsepower > 220) & (df.mpg > 15)]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model
116,16,8,400,230.000,4278,9.500,73,1,pontiac grand prix

There is an `isin()` function that allows you to search for multiple values in a column.

In [26]:
df[df['make_model'].isin(['ford torino 500', 'ford mustang', 'chevrolet camaro'])]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model
392,27,4,151,90.000,2950,17.300,82,1,chevrolet camaro
48,18,6,250,88.000,3139,14.500,71,1,ford mustang
36,19,6,250,88.000,3302,15.500,71,1,ford torino 500

The ~ can be used to do a "not". So below we filter for values in cylinders that are not equal to 4, 6, or 8

In [27]:
df[~df['cylinders'].isin([4, 6, 8])]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model
274,20,5,131,103.000,2830,15.900,78,2,audi 5000
327,36,5,121,67.000,2950,19.900,80,2,audi 5000s (diesel)
111,18,3,70,90.000,2124,13.500,73,3,maxda rx3
243,21,3,80,110.000,2720,13.500,77,3,mazda rx-4
334,23,3,70,100.000,2420,12.500,80,3,mazda rx-7 gs
71,19,3,70,97.000,2330,13.500,72,3,mazda rx2 coupe
297,25,5,183,77.000,3530,20.100,79,2,mercedes benz 300d

There are also string methods that can be used to filter strings. Let's find records where the make_model starts with "saab"

In [28]:
df[df.make_model.str.startswith('saab')]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model
22,25,4,104,95.000,2375,17.500,70,2,saab 99e
276,21,4,121,115.000,2795,15.700,78,2,saab 99gle
122,24,4,121,110.000,2660,14.000,73,2,saab 99le
180,25,4,121,115.000,2671,13.500,75,2,saab 99le

We can also do partial matching. Let's find records where the make_model contains 'reg' or 'sc' anywhere in the string.

In [29]:
df[df.make_model.str.contains('reg|sc')]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model
263,17,6,231,165.000,3445,13.400,78,1,buick regal sport coupe (turbo)
288,18,8,318,135.000,3830,15.200,79,1,dodge st. regis
352,29,4,98,65.000,2380,20.700,81,1,ford escort 2h
351,34,4,98,65.000,2045,16.200,81,1,ford escort 4w
278,31,4,89,71.000,1990,14.900,78,2,volkswagen scirocco

A few examples of other regular expressions that can be used:

    df.make_model.str.endswith('cobra')
    df.make_model.str.replace('chevy', 'cheverlot') # old, new

### Missing Values

Filter for the rows where horsepower is null

In [30]:
df[df['horsepower'].isnull()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model
374,23,4,151,nan,3035,20.500,82,1,amc concord dl
126,21,6,200,nan,2875,17.000,74,1,ford maverick
336,23,4,140,nan,2905,14.300,80,1,ford mustang cobra
32,25,4,98,nan,2046,19.000,71,1,ford pinto
354,34,4,100,nan,2320,15.800,81,2,renault 18i
330,40,4,85,nan,1835,17.300,80,2,renault lecar deluxe

The `dropna()` function can be used to drop all rows that contain a NaN value. The parameter inplace=True can be added to do this in place, but I want perserve the original dataframe for the next example.

In [31]:
df2 = df.dropna()
len(df2)

392

Replace NaN with 0

In [32]:
df['horsepower'].fillna(0, inplace=True)

### Working with strings

Most Python string functions are replicated in the pandas DataFrame. 

The example below converts the 'make_model' column to all uppercase. There is also a `lower()` to convert to lowercase and `len()` that would return the length of each value.

In [33]:
df['make_model'].str.upper().head()

96     AMC AMBASSADOR BROUGHAM
9           AMC AMBASSADOR DPL
66          AMC AMBASSADOR SST
315                AMC CONCORD
257                AMC CONCORD
Name: make_model, dtype: object

### Applying a Function to a DataFrame

Write a function to specify the region based on the numeric value of origin. Mapping: 1. American, 2. European, 3. Japanese.  Then apply this function to the current dataframe and create a new column with the newly defined values.

In [34]:
def region(df):
    if df['origin'] == 1:
        val = 'American'
    elif df['origin'] == 2:
        val = 'European'
    elif df['origin'] ==3:
        val = 'Japanese'
    else:
        val = ''
    return val

df['origin_region'] = df.apply(region, axis=1)  # axis=1 applies it column-wise
        
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model,origin_region
96,13,8,360,175.000,3821,11.000,73,1,amc ambassador brougham,American
9,15,8,390,190.000,3850,8.500,70,1,amc ambassador dpl,American
66,17,8,304,150.000,3672,11.500,72,1,amc ambassador sst,American
315,24,4,151,90.000,3003,20.100,80,1,amc concord,American
257,19,6,232,90.000,3210,17.200,78,1,amc concord,American

### Value Counts

The count for each distinct cylinder value

In [35]:
df['cylinders'].value_counts()

4    204
8    103
6     84
3      4
5      3
Name: cylinders, dtype: int64

### Groupby

Count the total records in each origin_region

In [36]:
df.groupby('origin_region').size()

origin_region
American    249
European     70
Japanese     79
dtype: int64

Let's calculate the average mpg and horsepower per region

In [37]:
df_region = df.groupby(['origin_region']).agg({'mpg':np.mean, 'horsepower':np.mean})
df_region

               horsepower    mpg
origin_region
American          117.137 19.928
European           78.257 27.743
Japanese           79.835 30.241

To avoid the headers being offset like they are above, we can add the parameter `as_index=False` when doing the groupby

In [38]:
df_region = df.groupby(['origin_region'], as_index=False).agg({'mpg':np.mean, 'horsepower':np.mean})
df_region

  origin_region  horsepower    mpg
0      American     117.137 19.928
1      European      78.257 27.743
2      Japanese      79.835 30.241

Let's calculate the minimum and maximum acceleration per region

In [39]:
df_region = df.groupby(['origin_region'], as_index=False).agg({'mpg':[np.min, np.max]})
df_region

  origin_region  mpg
                amin amax
0      American    9   39
1      European   16   44
2      Japanese   18   46

Pandas aggregation created a hierarchical index, we can flatten this by doing:

In [40]:
df_region.columns = [' '.join(col).strip() for col in df_region.columns.values]
df_region

  origin_region  mpg amin  mpg amax
0      American         9        39
1      European        16        44
2      Japanese        18        46

### Pivot Table

Take the average of all numeric columns for each origin_region

In [41]:
pd.pivot_table(df, index=['origin_region'], aggfunc='mean')

,acceleration,cylinders,displacement,horsepower,model_year,mpg,origin,weight
origin_region,,,,,,,,
American,15.034,6.249,245.900,117.137,75.610,19.928,1.000,"3,361.932"
European,16.787,4.157,109.143,78.257,75.814,27.743,2.000,"2,423.300"
Japanese,16.172,4.101,102.709,79.835,77.443,30.241,3.000,"2,221.228"

### Transpose a DataFrame

In [42]:
df.transpose()

,96,9,66,315,257,261,374,283,107,33,...,179,207,275,360,326,394,309,197,325,293
mpg,13,15,17,24,19,18,23,20,18,19,...,22,20,17,30,43,44,41,29,44,31
cylinders,8,8,8,4,6,6,4,6,6,6,...,4,4,6,6,4,4,4,4,4,4
displacement,360,390,304,151,232,258,151,232,232,232,...,121,130,163,145,90,97,98,90,90,89
horsepower,175.000,190.000,150.000,90.000,90.000,120.000,0.000,90.000,100.000,100.000,...,98.000,102.000,125.000,76.000,48.000,52.000,76.000,70.000,48.000,71.000
weight,3821,3850,3672,3003,3210,3410,3035,3265,2789,2634,...,2945,3150,3140,3160,2335,2130,2144,1937,2085,1925
acceleration,11.000,8.500,11.500,20.100,17.200,15.100,20.500,18.200,15.000,13.000,...,14.500,15.700,13.600,19.600,23.700,24.600,14.700,14.200,21.700,14.000
model_year,73,70,72,80,78,78,82,79,73,71,...,75,76,78,81,80,82,80,76,80,79
origin,1,1,1,1,1,1,1,1,1,1,...,2,2,2,2,2,2,2,2,2,2
make_model,amc ambassador brougham,amc ambassador dpl,amc ambassador sst,amc concord,amc concord,amc concord d/l,amc concord dl,amc concord dl 6,amc gremlin,amc gremlin,...,volvo 244dl,volvo 245,volvo 264gl,volvo diesel,vw dasher (diesel),vw pickup,vw rabbit,vw rabbit,vw rabbit c (diesel),vw rabbit custom
origin_region,American,American,American,American,American,American,American,American,American,American,...,European,European,European,European,European,European,European,European,European,European

The index becomes the column names. Remember the index is based on the data we read in and since we've sorted by the 'make_model' column the index now appears out of order.

You can also add `head()` to only transpose n number of rows

    df.head(1).transpose() # Transposes the dataframe keeping only the first row

### Melt to Reshape the Data

The `melt()` function 'unpivots' a DataFrame from wide format to long format. This can be usesful if you want one or more columns as identifier variables, while the other columns are considered measured variables. This can sometimes be useful in plotting.

In [43]:
pd.melt(df, id_vars=['origin_region'], value_vars=['mpg']).head()

  origin_region variable  value
0      American      mpg     13
1      American      mpg     15
2      American      mpg     17
3      American      mpg     24
4      American      mpg     19

### Indexing

#### Convert Index to a Column

In [44]:
df.reset_index(level=0).head() #The index becomes a column & the actual index is reset

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model,origin_region
0,96,13,8,360,175.000,3821,11.000,73,1,amc ambassador brougham,American
1,9,15,8,390,190.000,3850,8.500,70,1,amc ambassador dpl,American
2,66,17,8,304,150.000,3672,11.500,72,1,amc ambassador sst,American
3,315,24,4,151,90.000,3003,20.100,80,1,amc concord,American
4,257,19,6,232,90.000,3210,17.200,78,1,amc concord,American

#### Set One of the Columns to be the Index

I'm going to create a dummy DataFrame for this example since our DataFrame doesn't have any columns with unique values.

In [45]:
data = pd.DataFrame({'id': [1, 2, 3, 4],
                     'data1' : np.random.randn(4),
                     'data2' : np.random.randn(4)})
data

   data1  data2  id
0 -0.582 -2.121   1
1  0.098 -0.492   2
2 -0.977 -0.549   3
3 -0.170 -0.081   4

In [46]:
data = data.set_index('id')
data

    data1  data2
id
1  -0.582 -2.121
2   0.098 -0.492
3  -0.977 -0.549
4  -0.170 -0.081

The column label becomes the index name ("id"), to remove this we can do:

In [47]:
data.index.name = None
data

   data1  data2
1 -0.582 -2.121
2  0.098 -0.492
3 -0.977 -0.549
4 -0.170 -0.081

#### iloc & loc
We already saw how we can select columns, but we can also select data based on row labels. The way to retrieve data based on row labels depends on if row labels are numerical or label based.

If your rows have numerical indices, then use `.iloc`.

If your rows have an index of strings use `.loc`.

First, let's create a dummy dataframe with age, average weight, and average height that we can use for these examples.

In [48]:
ht_wgt = pd.DataFrame({'age': ['one', 'two', 'three', 'four', 'five'], 
                     'weight': [9.8, 12.3, 14.1, 15.4, 16.6],
                     'height': [21.6, 23, 24.2, 25.2, 26]})

ht_wgt

     age  height  weight
0    one  21.600   9.800
1    two  23.000  12.300
2  three  24.200  14.100
3   four  25.200  15.400
4   five  26.000  16.600

In [49]:
ht_wgt.iloc[1] #This retrieves the second row (remember: starts at 0)

age         two
height   23.000
weight   12.300
Name: 1, dtype: object

We can set the age column to be the index. Since this is in strings, we then use `.loc` to reference the rows.

In [50]:
ht_wgt = ht_wgt.set_index(['age']) # Make the age column the index
ht_wgt

       height  weight
age
one    21.600   9.800
two    23.000  12.300
three  24.200  14.100
four   25.200  15.400
five   26.000  16.600

In [51]:
ht_wgt.loc['three'] # Retrieve the row where the index = 'three'

height   24.200
weight   14.100
Name: three, dtype: float64

### Merging & Concatenating DataFrames

`merge()` and `join()` are essentially the same. They work similar to the SQL-like join operation.
- `merge()` joins on common columns by default
- `join()` joins on indexes by default

`concat()` stacks dataframes side by side or one on top of another.

First let's create two dummy DataFrames with data we can use for this example

In [52]:
demo = pd.DataFrame({'name': ['Emma', 'Sophia', 'Jacob', 'Adam'], 
                     'age': [24, 53, 35, 38], 
                     'marital_stat': ['S', 'M', 'M', 'S']})
                               
location = pd.DataFrame({'name': ['Emma', 'Sophia', 'Adam', 'William'], 
                         'city': ['Dallas', 'San Francisco', 'Orlando', 'San Diego']})

In [53]:
demo

   age marital_stat    name
0   24            S    Emma
1   53            M  Sophia
2   35            M   Jacob
3   38            S    Adam

In [54]:
location

            city     name
0         Dallas     Emma
1  San Francisco   Sophia
2        Orlando     Adam
3      San Diego  William

Now let's do an inner join on these two DataFrames by “name” to only keep rows that match between the column in both DataFrames.

By default `merge()` does an inner join, but you can specify 'left', 'right', or 'outer' joins.

In [55]:
merged_data = pd.merge(demo, location, how='inner')
merged_data

   age marital_stat    name           city
0   24            S    Emma         Dallas
1   53            M  Sophia  San Francisco
2   38            S    Adam        Orlando

`concat()` function: set parameter `axis` equal to 0 for top/bottom concatenation and to 1 for left/right concatenation

**Beware** in using concat, you can end up with duplicate rows or columns

In [56]:
concat_vert = pd.concat([demo, location], axis=1) #left/right
concat_vert

   age marital_stat    name           city     name
0   24            S    Emma         Dallas     Emma
1   53            M  Sophia  San Francisco   Sophia
2   35            M   Jacob        Orlando     Adam
3   38            S    Adam      San Diego  William

In [57]:
location2 = pd.DataFrame({'name': ['Luke', 'Peter'], 
                          'city': ['Raleigh', 'New York']})

pd.concat([location, location2], axis=0) #top/bottom

            city     name
0         Dallas     Emma
1  San Francisco   Sophia
2        Orlando     Adam
3      San Diego  William
0        Raleigh     Luke
1       New York    Peter

### Create a Copy of a DataFrame

The pandas' `copy()` method makes a copy of the current dataframe, which will make it so that changes to one dataframe does not affect the other.

*Correct way:*

In [58]:
df2 = df.copy()
df2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model,origin_region
96,13,8,360,175.000,3821,11.000,73,1,amc ambassador brougham,American
9,15,8,390,190.000,3850,8.500,70,1,amc ambassador dpl,American
66,17,8,304,150.000,3672,11.500,72,1,amc ambassador sst,American
315,24,4,151,90.000,3003,20.100,80,1,amc concord,American
257,19,6,232,90.000,3210,17.200,78,1,amc concord,American

In [59]:
df['test'] = 1   # Add a new column to the original dataframe
df.head()  # Verify it was changed

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model,origin_region,test
96,13,8,360,175.000,3821,11.000,73,1,amc ambassador brougham,American,1
9,15,8,390,190.000,3850,8.500,70,1,amc ambassador dpl,American,1
66,17,8,304,150.000,3672,11.500,72,1,amc ambassador sst,American,1
315,24,4,151,90.000,3003,20.100,80,1,amc concord,American,1
257,19,6,232,90.000,3210,17.200,78,1,amc concord,American,1

In [60]:
df2.head() # The new dataframe was not affected by the new column being added to the original dataframe

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model,origin_region
96,13,8,360,175.000,3821,11.000,73,1,amc ambassador brougham,American
9,15,8,390,190.000,3850,8.500,70,1,amc ambassador dpl,American
66,17,8,304,150.000,3672,11.500,72,1,amc ambassador sst,American
315,24,4,151,90.000,3003,20.100,80,1,amc concord,American
257,19,6,232,90.000,3210,17.200,78,1,amc concord,American

*Wrong Way:*

In [61]:
df.drop('test', axis=1, inplace=True) # Remove the 'test' column to revert df back to how it was before the last example
df2 = df  # This creates a new dataframe from the original, but's not a copy so changes to one dataframe will affect the other 
df['test'] = 1   # Add a new column to the original dataframe
df2.head()   # The newly added column in the original dataframe is also added to the newer dataframe

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,make_model,origin_region,test
96,13,8,360,175.000,3821,11.000,73,1,amc ambassador brougham,American,1
9,15,8,390,190.000,3850,8.500,70,1,amc ambassador dpl,American,1
66,17,8,304,150.000,3672,11.500,72,1,amc ambassador sst,American,1
315,24,4,151,90.000,3003,20.100,80,1,amc concord,American,1
257,19,6,232,90.000,3210,17.200,78,1,amc concord,American,1